{
	"sidenav": {
		"info": {
			"stack": "Fullstack Developer",
			"in": "in Colombia"
		},
		"nav": {
			"home": "home",
			"about": "about",
			"skills": "skills",
			"education": "education",
			"experience": "experience",
			"work": "work",
			"contact": "contact"
		}
	},
	"about": {
		"h": "about me",
		"t": "who am i?",
		"p1": "I'm currently a Systems Engineering student at the Metropolitan Technological Institute (ITM), I'm also very self-taught, with a taste for continuous learning and my goal is to be a great professional in the development of web applications so I want to start in the world of work. I've knowledge of frontend as well as backend and I have several projects where I use different technologies. I'm responsible, a kind person and I like teamwork.",
		"p2": "I really appreciate good communication with people, so I constantly learn English which allows me to communicate with foreing people, in addition my self-taught learning style allows me to improve and learn new things every day. I'm very interested in getting a job as a web developer either in a company or as a freelance worker, I've different skills and aptitudes so I invite you to know more about me and do not hesitate to contact me if you have any questions.",
		"abilities": {
			"1": "Frontend",
			"2": "Backend",
			"3": "Databases",
			"4": "Software"
		}
	},
	"skills": {
		"h": "my specialty",
		"t": "my skills",
		"a": {
			"t": "angular",
			"p": "Angular is my quintessential frontend framework, it's very agile and versatile. I've different capabilities regarding it, in addition to coupling it with responsive web design, Scss and some framework such as Bootstrap or Material design regarding styles."
		},
		"n": {
			"t": "node js",
			"p": "Node allows me to create the server of my web pages quickly, I usually create my applications with TypeScript, JWT, Multer, among others, which allow me to develop complex things such as authentication or file management."
		},
		"e": {
			"t": "express",
			"p": "The Express framework helps me to create my server easily and quickly together Node, it provides me with the necessary tools for my applications, I usually develop these applications with TypeScript or, failing that, with JavaScript."
		},
		"db": {
			"t": "database",
			"p": "I've the ability to manage Sql as well as NoSql databases, I usually use MySql or MongoDB respectively together Node and Express for the development of my applications where it's necessary to make the information last over time."
		},
		"p": "The technologies mentioned above are my main tools for web development and I've several projects where I use them, I also have an interest in learning new technologies such as React, GraphQL, Go or any related to the world of software development. To carry out my projects I also made a lot of use of the following tools, which I've the ability to use for development.",
		"tec": {
			"r": "Responsive web design",
			"a": "API integration"
		}
	},
	"education": {
		"h": "education",
		"t": "education",
		"ed": {
			"1": {
				"t": "systems engineer student",
				"p": "I'm currently studying Software Development and eventually Systems Engineering at the ITM in which I'm part of a research seedbed on Supportive Technologies for Inclusion (TAI) where I'm the main developer of a web page together with the team."
			},
			"2": {
				"t": "Web Development",
				"p": "I studied programming skills with an emphasis on web applications (TIC Mission 2022), with an hourly intensity of 800 hours. More information about this grade at"
			},
			"3": {
				"t": "high school",
				"p": "The school where I graduated is called Centro Educativo Autónomo (CEA), I was in my last grade in 2019 and finally graduated."
			}
		}
	},
	"experience": {
		"h": "experience",
		"t": "work experience",
		"1": {
			"t": {
				"work": "Fullstack Developer (Javier Propiedades)",
				"time": "Jun 2021 - 2022"
			},
			"p": "I developed the backend and frontend of a web application focused on real estate sales, the owner can enter as an administrator and change the contents of the web."
		}
	},
	"work": {
		"h": "my work",
		"t": "mi recent work",
		"projects": {
			"1": {
				"t": "Javier Propiedades",
				"c": "web site",
				"p": "This website is developed with MongoDB, Express, Angular 2+, Node.js (MEAN Stack), I also use Angular SSR, Bootstrap, JWT, AWS S3, Google Maps and Places API, Matterport Virtual Tours."
			},
			"2": {
				"t": "cash register",
				"c": "web site",
				"p": "This is my main project which consists of a web page to manage restaurants, it allows to have an inventory, view diagrams and reports, among other functionalities. If you want to know more about the project, I invite you to see the repository on GitHub or contact me if you want to access the page."
			},
			"3": {
				"t": "dictionary of neologisms",
				"c": "web site",
				"p": "The Dictionary of Neologisms is the web page that I'm developing with the TAI research seedbed. I invite you to know more about him in the GitHub repository."
			}
		}
	},
	"contact": {
		"h": "get in touch",
		"t": "contact",
		"info": {
			"a": "Street 105 #64 e 41 - Medellin, Colombia."
		},
		"f": {
			"n": "Name",
			"e": "Email",
			"s": "Subject",
			"m": "Message"
		},
		"err": {
			"n": {
				"r": "The name is required"
			},
			"e": {
				"r": "The email is required",
				"f": "The email isn't in a valid format"
			},
			"s": {
				"r": "The subject is required"
			},
			"m": {
				"r": "The maximum characters allowed are"
			},
			"gen": {
				"chars": {
					"of": "of",
					"chars": "characters required"
				},
				"max": "The maximum characters allowed are"
			}
		},
		"mes": {
			"send": "send message",
			"err": "The message couldn't be sent",
			"sent": "Message sent succesfully"
		}
	},
	"footer": {
		"by": "Written and Coded by"
	},
	"langs": {
		"en": "English",
		"es": "Spanish"
	}
}