{
	"sidenav": {
		"info": {
			"stack": "Desarrollador Fullstack",
			"in": "en Colombia"
		},
		"nav": {
			"home": "inicio",
			"about": "acerca de",
			"skills": "habilidades",
			"education": "educacion",
			"experience": "experiencia",
			"work": "trabajo",
			"contact": "contacto"
		}
	},
	"about": {
		"h": "acerca de mi",
		"t": "¿quien soy?",
		"p1": "Actualmente soy estudiante de Ingeniería de Sistemas en el Instituto Tecnológico Metropolitano (ITM), además soy muy autodidacta, con gusto por el aprendizaje continuo y mi meta es ser un gran profesional en el desarrollo de aplicaciones web por lo que quiero iniciar en el mundo laboral. Poseo conocimientos tanto en frontend como en backend y tengo varios proyectos donde utilizo diferentes tecnologías. Soy una persona responsable, amable y me gusta trabajar en equipo.",
		"p2": "Aprecio mucho una buena comunicación con las personas por lo que aprendo ingles constantemente lo cual me permite la comunicación con personas del extranjero además mi estilo de aprendizaje autodidacta me permite cada día mejorar y aprender nuevas cosas. Me interesa mucho obtener un trabajo como desarrollador web ya sea en una empresa o como trabajador autónomo, tengo distintas habilidades y aptitudes así que te invito a conocer más de mí y no dudes en contactarme si tienes alguna pregunta.",
		"abilities": {
			"1": "Frontend (Cliente)",
			"2": "Backend (Servidor)",
			"3": "Bases de datos",
			"4": "Software (Programa Informatico)"
		}
	},
	"skills": {
		"h": "mi especialidad",
		"t": "mis habilidades",
		"a": {
			"t": "angular",
			"p": "Angular es mi framework frontend por excelencia, es muy ágil y versátil. Tengo diferentes capacidades referentes a el, además lo acoplo con el diseño web responsivo, Scss y algún framework como Bootstrap o Material design referente a los estilos."
		},
		"n": {
			"t": "node js",
			"p": "Node me permite crear el servidor de mis páginas web ágilmente, suelo crear mis aplicaciones con TypeScript, JWT, Multer, entre otros, los cuales me permiten desarrollar cosas complejas como autenticación o administración de archivos."
		},
		"e": {
			"t": "express",
			"p": "El framework Express me ayuda a crear mi servidor de forma sencilla y rápida en conjunto con Node, este me proporciona las herramientas necesarias para mis aplicaciones, usualmente desarrollo estas aplicaciones con TypeScript o en su defecto con JavaScript."
		},
		"db": {
			"t": "bases de datos",
			"p": "Tengo la capacidad de gestionar bases de datos tanto Sql como NoSql, suelo usar MySql o MongoDB respectivamente en conjunto con Node y Express para el desarrollo de mis aplicaciones donde es necesario hacer que la información perdure en el tiempo."
		},
		"p": "Las tecnologías anteriormente mencionadas son mis herramientas principales para el desarrollo web y tengo varios proyectos donde las uso, también tengo interés en aprender nuevas tecnologías tales como React, GraphQL, Go o cualquiera relacionada con el mundo del desarrollo de software. Para llevar a cabo mis proyectos también hice mucho uso de las siguientes herramientas, las cuales tengo la capacidad de usarlas para el desarrollo.",
		"tec": {
			"r": "Diseño web responsivo",
			"e": "Electron / Aplicaciones de escritorio"
		}
	},
	"education": {
		"h": "educación",
		"t": "educación",
		"ed": {
			"1": {
				"t": "estudiante de ingeniería de sistemas",
				"p": "Actualmente estoy estudiando Desarrollo de Software y eventualmente Ingeniería de Sistemas en el ITM en el cual hago parte de un semillero de investigación acerca de Tecnologías de Apoyo a la Inclusión (TAI) donde soy el principal desarrollador una página web en conjunto con el equipo."
			},
			"2": {
				"t": "bachiller",
				"p": "El colegio donde me gradúe se llama Centro Educativo Autónomo (CEA), curse el ultimo grado en 2019 y finalmente me gradúe."
			}
		}
	},
	"experience": {
		"h": "experiencia",
		"t": "experiencia laboral",
		"1": {
			"t": {
				"work": "Desarrollador Fullstack en TAI",
				"time": "2020 - Actualmente"
			},
			"p": "Estoy desarrollando una web llamada Diccionario de Neologismos con el stack MEAN. El sitio web consta de un apartado para administrar el contenido de un diccionario de neologismos que estará disponible para el consumo de los estudiantes del ITM y más universidades del área metropolitana."
		}
	},
	"work": {
		"h": "mi trabajo",
		"t": "mi trabajo más reciente",
		"projects": {
			"1": {
				"t": "caja registradora",
				"c": "sitio web",
				"p": "Este es mi proyecto principal el cual consta de un página web para administrar restaurantes, permite tener un inventario, ver diagramas e informes, entre otras funcionalidades. Si quieres saber más del proyecto te invito a ver el repositorio en GitHub o contacta conmigo en caso de querer acceder a la página."
			},
			"2": {
				"t": "diccionario de neologismos",
				"c": "sitio web",
				"p": "El Diccionario de Neologismos es la página web que estoy desarrollando con el semillero de investigación TAI. Te invito a conocer más acerca de el en el repositorio de GitHub."
			}
		}
	},
	"contact": {
		"h": "estemos en contacto",
		"t": "contacto",
		"info": {
			"a": "Calle 105 #64 e 41 - Medellin, Colombia."
		},
		"f": {
			"n": "Nombre",
			"e": "Email",
			"s": "Asunto",
			"m": "Mensaje"
		},
		"err": {
			"n": {
				"r": "El nombre es requerido"
			},
			"e": {
				"r": "El correo electronico es requerido",
				"f": "El correo electronico no tiene un formato valido"
			},
			"s": {
				"r": "El asunto es requerido"
			},
			"m": {
				"r": "El mensaje es requerido"
			},
			"gen": {
				"chars": {
					"of": "de",
					"chars": "caracteres requeridos"
				},
				"max": "el maximo de caracteres son"
			}
		},
		"mes": {
			"send": "enviar mensaje",
			"err": "El mensaje no se pudo enviar",
			"sent": "El mensaje se envio satisfactoriamente"
		}
	},
	"footer": {
		"by": "Escrito y Codificado por"
	},
	"langs": {
		"en": "Ingles",
		"es": "Español"
	}
}
