{
	"sidenav": {
		"info": {
			"stack": "Desarrollador Fullstack",
			"in": "en Colombia"
		},
		"nav": {
			"home": "inicio",
			"about": "acerca de",
			"skills": "habilidades",
			"education": "educacion",
			"experience": "experiencia",
			"work": "trabajo",
			"contact": "contacto"
		}
	},
	"about": {
		"h": "acerca de mi",
		"t": "¿quien soy?",
		"p1": "Soy una persona paciente, amable y me gusta trabajar en equipo. En el momento me encuentro en busqueda de un empleo como desarrollador de paginas web, estudio actualmente Ingenieria de Sistemas en el Instituto Tecnologico Metropolitano De Medellin (ITM).",
		"p2": "A demas soy perfeccionista con gusto por la actualización constante y el aprendizaje continuo, me encanta investigar y aprender por mi cuenta.",
		"abilities": {
			"1": "Frontend",
			"2": "Backend",
			"3": "Software",
			"4": "Aplicaciones de escritorio"
		}
	},
	"skills": {
		"h": "mi especialidad",
		"t": "mis habilidades",
		"a": {
			"t": "angular",
			"p": "Me encanta desarrollar paginas web con el framework angular, es muy agil y verstalil. Tengo la capacidad de crear responsive web desings y usualmente uso scss para los estilos."
		},
		"n": {
			"t": "node js",
			"p": "Amo crear el servidor de mis aplicaciones con Node, ademas lo uso en conjunto con Express, Multer, JWT, entre otras. Para poder crear aplicaciones mas complejas como con subida de archivos y autenticaion."
		},
		"e": {
			"t": "express",
			"p": "El framework Express me ayuda a crear mi backend de forma sencilla y rapida, me gusta desarrollar mi backend Express usando TypeScript, pero tambien tengo la capcidad de hacerlo con JavaScript."
		},
		"db": {
			"t": "bases de datos",
			"p": "Para mis aplicaiones suelo usar tanto MySql como MongoDB, tengo la capacidad de usarlos en conjunto con Node y Express para hacer que los datos perduren en el tiempo."
		},
		"p": "Las tecnologias anteriormente mencionadas son mis herramientas principales para desarollar web y tengo varios proyectos donde las uso, a demas tambien para realizar mis proyectos uso las siguientes tecnologias:",
		"tec": {
			"e": "Electron / Aplicaciones de escritorio."
		}
	},
	"education": {
		"h": "educacion",
		"t": "educacion",
		"ed": {
			"1": {
				"t": "estudiante de ingenieria de sistemas",
				"p": "Actualmente estoy estudiando Desarollo de Software y eventualmente Ingenieria de Sistemas en el Instituto Metropolitano De Medellin (ITM), hago parte de un semillero de investiagion nombrado TAI donde desarrollo una pagina web."
			},
			"2": {
				"t": "bachiller",
				"p": "El colegio donde me gradue se llama Centro Educativo Autonomo (CEA), curse el ultimo grado en 2019 y finalmente me gradue."
			}
		}
	},
	"experience": {
		"h": "experiencia",
		"t": "experiencia laboral",
		"1": {
			"t": {
				"work": "Desarrollador Fullstack en el ITM",
				"time": "2020 - Actualmente"
			},
			"p": "Estoy desarrollando una web con el stack MEAN. El sitio web consta de un apartado para administrar el contenido de un diccionario de neologismos."
		}
	},
	"contact": {
		"h": "estemos en contacto",
		"t": "contacto",
		"info": {
			"a": "Calle 105 #64 e 41 - Medellin, Colombia."
		},
		"f": {
			"n": "Nombre",
			"e": "Email",
			"s": "Asunto",
			"m": "Mensaje"
		},
		"err": {
			"n": {
				"r": "El nombre es requerido"
			},
			"e": {
				"r": "El correo electronico es requerido",
				"f": "El correo electronico no tiene un formato valido"
			},
			"s": {
				"r": "El asunto es requerido"
			},
			"m": {
				"r": "El mensaje es requerido"
			},
			"gen": {
				"chars": {
					"of": "de",
					"chars": "caracteres requeridos"
				},
				"max": "el maximo de caracteres son"
			}
		},
		"mes": {
			"send": "enviar mensaje",
			"err": "El mensaje no se pudo enviar",
			"sent": "El mensaje se envio satisfactoriamente"
		}
	},
	"footer": {
		"by": "Escrito y Codificado por"
	},
	"langs": {
		"en": "Ingles",
		"es": "Español"
	}
}
